system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.001 -0.001  -0.001)
    (-0.001 -0.001  1.001)
    (1.001  -0.001  1.001)
    (1.001  -0.001  -0.001)
    (-0.001 3.001 -0.001)
    (-0.001 3.001 1.001)
    (1.001  3.001 1.001)
    (1.001  3.001 -0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) fluid (10 30 10) simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
    type empty;
    name default;
}

boundary
(
);

// ************************************************************************* //
